Revit 2024 API
IExportContext.OnElementEnd Method
 This method marks the end of an element being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void OnElementEnd(
	ElementId elementId
)
Visual Basic
Sub OnElementEnd ( _
	elementId As ElementId _
)
Visual C++
void OnElementEnd(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 The Id of the element that has just been processed.
Remarks
 This method is never called for 2D export (see cref="Autodesk::Revit::DB::IExportContext2D").
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace